

package leetcode.editor.cn.dp.bagage;
//有一堆石头，用整数数组 stones 表示。其中 stones[i] 表示第 i 块石头的重量。 
//
// 每一回合，从中选出任意两块石头，然后将它们一起粉碎。假设石头的重量分别为 x 和 y，且 x <= y。那么粉碎的可能结果如下： 
//
// 
// 如果 x == y，那么两块石头都会被完全粉碎； 
// 如果 x != y，那么重量为 x 的石头将会完全粉碎，而重量为 y 的石头新重量为 y-x。 
// 
//
// 最后，最多只会剩下一块 石头。返回此石头 最小的可能重量 。如果没有石头剩下，就返回 0。 
//
// 
//
// 示例 1： 
//
// 
//输入：stones = [2,7,4,1,8,1]
//输出：1
//解释：
//组合 2 和 4，得到 2，所以数组转化为 [2,7,1,8,1]，
//组合 7 和 8，得到 1，所以数组转化为 [2,1,1,1]，
//组合 2 和 1，得到 1，所以数组转化为 [1,1,1]
//组合 1 和 1，得到 0，所以数组转化为 [1]，这就是最优值。
// 
//
// 示例 2： 
//
// 
//输入：stones = [31,26,33,21,40]
//输出：5
// 
//
// 
//
// 提示： 
//
// 
// 1 <= stones.length <= 30 
// 1 <= stones[i] <= 100 
// 
// Related Topics 数组 动态规划 👍 434 👎 0

class P1049_LastStoneWeightIi{
    public static void main(String[] args) {
        //测试代码
        Solution solution = new P1049_LastStoneWeightIi().new Solution();
    }
//力扣代码
	//leetcode submit region begin(Prohibit modification and deletion)
class Solution {
    // 任意取两个石头进行碰撞，根据 x和y求，剩y-x的重量；问剩下的最小重量可能是
    // 问题转化为：把一堆石头分成两堆,求两堆石头重量差最小值
    // 相当于，把石头分成 重量 尽可能相同的 两堆，那不就是 sum/2
    // => 相当于，我先分出一堆石头，总重量为 sum/2,剩下的重量就是 sum - sum/2
    // sum - sum/2 - sum/-2 就会得到尽可能小的差值！
    // 相当于又变成了01背包问题，用dp获得一个重量最接近sum/2的背包
    // 1. dp[i]表示当前重量下，能放入的最大物品价值
    // 2. 递推公式，我们用01背包的一层数组，dp[j]=max(dp[j],dp[j-weight[i]]+value[i]
    // weight = stone value = stone
    // 3. 初始化，因为重量都是正数，所以dp[i]初始化为0就好
    // 4. 01数组的一维情况，两层遍历，i在外层、j在内层；i为物品、j为重量;重量为sum/2
    // 5. 举例：[2,7,4,1,8,1] sum=23 sum/2=11
    // dp[11]={0,1,1,1,4,5,6,7,8,9,10,11} dp[target]为其中一个石堆的最大价值（重量
    // 6. 因为要求最小差值，另一堆重量就为 sum-dp[target];差值:sum - dp[target] - dp[target]
    public int lastStoneWeightII(int[] stones) {
        int sum=0;
        for (int i = 0; i < stones.length; i++) {
            sum+=stones[i];
        }
        int target=sum/2;
        int[] dp = new int[target+1];
        // 找最大价值，外层物品，内层重量倒序
        for (int i = 0; i < stones.length; i++) {
            for (int j = target; j >=stones[i] ; j--) {
                dp[j]=Math.max(dp[j],dp[j-stones[i]]+stones[i]);
            }
        }
        return sum-dp[target]-dp[target];
    }
}
//leetcode submit region end(Prohibit modification and deletion)

}
